**Feature Engineering**

  - So far we have feature analysis
  - Data frame quick check
  - Categorical column analysis
  - Bar charts, pie charts
  - Numerical column analysis
  - Histogram, bix plot, outliers
  - Bi-multi variate analysis
  - correlation etc

- Now we need to learn feature engeering
-   we will create a new coloumn for better ML models
-   we will peroform the **Encoding**, which is convert categorical to Numerical data
-   we wil do data **Transformations**
-   we will perform **Scalling: Standardisation and Normalisation**
-   we will perform the **missing value analysis**

- Simply feature enginnering means our data will be modified

In [4]:
# import numpy as np
# import pandas as pd
# import matplotlib.pyplot as plt
# import seaborn as sns

# file_path=r"/Users/suniltomar/Desktop/workspace/nareshit_ds/DS_app1/Visadataset.csv"
# visa_df=pd.read_csv(file_path)


# cat=visa_df.select_dtypes(include='object').columns
# num=visa_df.select_dtypes(exclude='object').columns

# visa_df

- Feature Analysis
- Feature Engineerig
- Feature Selection
- Model development
- Model evaluation
- Model tuning
- Model deployment

**Encoding**
- Encoding means covert categorical data to numerical data
- ML/DL or any models works based on maths
- Models can not understand english characters
- SO it is very important covert categrical label to numerical values
- For example Gender column has two labels
- - Male
  - Female
- Then Female represent as 0, Male as represent as 1  based on alphbetical order

In [60]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

file_path=r"/Users/suniltomar/Desktop/workspace/nareshit_ds/DS_app1/Visadataset.csv"
visa_df=pd.read_csv(file_path)
bg_visa_df=pd.read_csv(file_path)

# cat=visa_df.select_dtypes(include='object').columns
# num=visa_df.select_dtypes(exclude='object').columns

visa_df
# visa_df['case_status']

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

- Certifed should assign as 0
- Denied should assign as 1

In [50]:
# case_status=visa_df['case_status']



# for record in case_status:
#     if record=='Certified':
#         print('0')
#     elif  record=='Denied':
#         print('1')

d={'Certified':0, 'Denied': 1}
d

visa_df['case_status']

0           Denied
1        Certified
2           Denied
3           Denied
4        Certified
           ...
25475    Certified
25476    Certified
25477    Certified
25478    Certified
25479    Certified
Name: case_status, Length: 25480, dtype: object

In [61]:
visa_df['case_status']=visa_df['case_status'].map(d)

In [52]:
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,1
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,0
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,1
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,1
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,0
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,0
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,0
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,0
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,0
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,0

In [32]:
# if you are getting NaN you run double time
# so do one by one from starting
# read the data
# select the columns
# create a mapper
# map to select column

In [53]:
d={''}
visa_df['continent'].unique()

array(['Asia', 'Africa', 'North America', 'Europe', 'South America',
       'Oceania'], dtype=object)

In [54]:
d={'Asia':0, 'Africa':1, 'North America':2, 'Europe':3, 'South America':4,
       'Oceania':5}
d

{'Asia': 0,
 'Africa': 1,
 'North America': 2,
 'Europe': 3,
 'South America': 4,
 'Oceania': 5}

In [55]:
d={}
i=0
for countinent in visa_df['continent'].unique():
    d[countinent]=i
    i=i+1

d

{'Asia': 0,
 'Africa': 1,
 'North America': 2,
 'Europe': 3,
 'South America': 4,
 'Oceania': 5}

In [56]:
visa_df['continent']=visa_df['continent'].map(d)

In [57]:
visa_df['continent']

0        0
1        0
2        0
3        0
4        1
        ..
25475    0
25476    0
25477    0
25478    0
25479    0
Name: continent, Length: 25480, dtype: int64

In [58]:
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,0,High School,N,N,14513,2007,West,592.2029,Hour,Y,1
1,EZYV02,0,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,0
2,EZYV03,0,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,1
3,EZYV04,0,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,1
4,EZYV05,1,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,0
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,0,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,0
25476,EZYV25477,0,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,0
25477,EZYV25478,0,Master's,Y,N,1121,1910,South,146298.8500,Year,N,0
25478,EZYV25479,0,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,0
25479,EZYV25480,0,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,0

In [48]:
visa_df['continent'].unique()

array([0, 1, 2, 3, 4, 5])

In [59]:
bg_visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,0,High School,N,N,14513,2007,West,592.2029,Hour,Y,1
1,EZYV02,0,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,0
2,EZYV03,0,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,1
3,EZYV04,0,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,1
4,EZYV05,1,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,0
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,0,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,0
25476,EZYV25477,0,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,0
25477,EZYV25478,0,Master's,Y,N,1121,1910,South,146298.8500,Year,N,0
25478,EZYV25479,0,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,0
25479,EZYV25480,0,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,0

In [62]:
# step-1: read the data
# step-2: get the cat columns

# for Loop on cat start with 1
# Lables=sorted(visa_df[i].unique ())
#d={j:i for i, j in enumerate(Lables)} #visa_df[i]=visa_df[i].map(d)

In [65]:

file_path=r"/Users/suniltomar/Desktop/workspace/nareshit_ds/DS_app1/Visadataset.csv"
visa_df=pd.read_csv(file_path)
cat=visa_df.select_dtypes(include='object').columns

In [66]:
cat

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'region_of_employment', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [67]:
for i in cat[1:]:
    labels=sorted(visa_df[i].unique())
    d={j:i for i,j in enumerate(labels)} #
    visa_df[i]=visa_df[i].map(d)

visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,1,2,0,0,14513,2007,4,592.2029,0,1,1
1,EZYV02,1,3,1,0,2412,2002,2,83425.6500,3,1,0
2,EZYV03,1,0,0,1,44444,2008,4,122996.8600,3,1,1
3,EZYV04,1,0,0,0,98,1897,4,83434.0300,3,1,1
4,EZYV05,0,3,1,0,1082,2005,3,149907.3900,3,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,1,0,1,1,2601,2008,3,77092.5700,3,1,0
25476,EZYV25477,1,2,1,0,3274,2006,2,279174.7900,3,1,0
25477,EZYV25478,1,3,1,0,1121,1910,3,146298.8500,3,0,0
25478,EZYV25479,1,3,1,1,1918,1887,4,86154.7700,3,1,0
25479,EZYV25480,1,0,1,0,3195,1960,1,70876.9100,3,1,0

**LabelEncoder**

- It is under package *Sklearn(sickit-learn)**
- - This is class Name: **Preprocessing**
  - - The method name: LabelEncoder

In [68]:
#from <package>.<class> import <method>
from sklearn.preprocessing import LabelEncoder

- step-1: import the method
- step-2: save the method
- step-3: apply fit transform
- **fit transform**
- - **fit**: means find the logic
  - - in above example fit means create **mapper** or **dict**
- - **transform**: apply the logic and change the data
  - - apply the mapper on the data

In [71]:

file_path=r"/Users/suniltomar/Desktop/workspace/nareshit_ds/DS_app1/Visadataset.csv"
visa_df=pd.read_csv(file_path)
cat=visa_df.select_dtypes(include='object').columns

# import the method
from sklearn.preprocessing import LabelEncoder

#save the method
le=LabelEncoder()

#apply the fit transform
visa_df['case_status']=le.fit_transform(visa_df['case_status'])

In [72]:
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,1
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,0
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,1
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,1
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,0
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,0
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,0
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,0
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,0
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,0

In [73]:

file_path=r"/Users/suniltomar/Desktop/workspace/nareshit_ds/DS_app1/Visadataset.csv"
visa_df=pd.read_csv(file_path)
cat=visa_df.select_dtypes(include='object').columns

#import the method
from sklearn.preprocessing import LabelEncoder

# save the method
le=LabelEncoder()

#apply fit transform
visa_df['continent']=le.fit_transform(visa_df['continent'])

In [74]:
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,1,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,1,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,1,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,1,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,0,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,1,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,1,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,1,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,1,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,1,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [75]:
visa_df['continent'].unique()

array([1, 0, 3, 2, 5, 4])

In [78]:

#read the data
file_path=r"/Users/suniltomar/Desktop/workspace/nareshit_ds/DS_app1/Visadataset.csv"
visa_df=pd.read_csv(file_path)
cat=visa_df.select_dtypes(include='object').columns

# apply for loop
from sklearn.preprocessing import LabelEncoder

le=LabelEncoder()

# for i, j in enumerate(visa_df):
    # print(i,j)

for i in cat[1:]:
    # labels=sorted(visa_df[i].unique())
    # d={j:i for i,j in enumerate(labels)} #
    visa_df[i]=le.fit_transform(visa_df[i])

In [79]:
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,1,2,0,0,14513,2007,4,592.2029,0,1,1
1,EZYV02,1,3,1,0,2412,2002,2,83425.6500,3,1,0
2,EZYV03,1,0,0,1,44444,2008,4,122996.8600,3,1,1
3,EZYV04,1,0,0,0,98,1897,4,83434.0300,3,1,1
4,EZYV05,0,3,1,0,1082,2005,3,149907.3900,3,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,1,0,1,1,2601,2008,3,77092.5700,3,1,0
25476,EZYV25477,1,2,1,0,3274,2006,2,279174.7900,3,1,0
25477,EZYV25478,1,3,1,0,1121,1910,3,146298.8500,3,0,0
25478,EZYV25479,1,3,1,1,1918,1887,4,86154.7700,3,1,0
25479,EZYV25480,1,0,1,0,3195,1960,1,70876.9100,3,1,0

**OneHotEncoder**

- First how many labels are there in a column
- That many new columns will be created extra
- - Certified
  - Denied

- So It will create those new extra columns
- - case_status_Certified
  - case_stataus_Denied
- At a time one column value become 1 other column value become 0
- This means a **one hot encoder**
- 
```
|case_status case_status_Certified|case_status_Denied|
|-|-|-|
Certified 1 0
Denied 0 1
Denied 0 1 (Certified)
```

In [80]:
# continent C_A  C_Af  C_E
# Asia       1    0    0
# Africa     0    1    0
#Europe      0    0    1

**pd.get_dummies**

In [83]:

#read the data
file_path=r"/Users/suniltomar/Desktop/workspace/nareshit_ds/DS_app1/Visadataset.csv"
visa_df=pd.read_csv(file_path)
# cat=visa_df.select_dtypes(include='object').columns

pd.get_dummies(visa_df['case_status'], dtype=int)

       Certified  Denied
0              0       1
1              1       0
2              0       1
3              0       1
4              1       0
...          ...     ...
25475          1       0
25476          1       0
25477          1       0
25478          1       0
25479          1       0

[25480 rows x 2 columns]

#

# 1. A Quick Example

- Review1='Game of Thrones is about amazing tv series'
- Review2='Game of Thrones is the best tv series'
- Review3='Game of Thrones is to great'

### In the table I show all the calculations to obtain the Bag-Of-Words approach

#Vocabulary

In [84]:
Review1='Game of Thrones is about amazing tv series'
Review2='Game of Thrones is the best tv series'
Review3='Game of Thrones is to great'